app/controllers/home_controller.rb

SELECT "projects".* FROM "projects"
---
  def index
    @categories = Category.all
    @projects = Project.all