app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "crypted_password", "created_at", "updated_at", "salt") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save