app/views/categories/index.html.erb

    <h3><%= category.name %></h3>
    <% category.projects.all[0..3].each do |project| %>
---
SELECT "projects".* FROM "projects" WHERE "projects"."category_id" = $1  [["category_id", 1]]